---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Zone.Perimeter
source: html/c2cd4dc0-7b4d-65cf-39cb-68ce826ee1e3.htm
---
# Autodesk.Revit.DB.Mechanical.Zone.Perimeter Property

Get the Perimeter of the Zone.

## Syntax (C#)
```csharp
public double Perimeter { get; }
```

## Remarks
This property is used to get the Perimeter of the Zone.